Repository: Tedyst/FII-ASET
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Stock symbol:
ro: Simbol bursier:

source: No previous data
ro: Fără date anterioare

source: Sell
ro: Vinde

source: Price Alert
ro: Alertă de preț

source: Share
ro: Distribuie

source: No data
ro: Fără date

source: Holders
ro: Deținători

source: ASET Trading App
ro: ASET Aplicatie de Trading

source: Login
ro: Intra in cont

source: Account
ro: Cont

source: Board
ro: Bordul

source: Need help? Contact us at
ro: Ai nevoie de ajutor? Contacteaza-ne la

source: Welcome to
ro: Bun venit la

source: ASET-FII Tradingg
ro: ASET Aplicatie de Trading

source: Trade smarter with our browser-based trading app.
ro: Tranzacționează mai inteligent cu aplicația noastră de tranzacționare bazată pe browser.

source: Start Trading Now
ro: Începe să tranzacționezi acum

source: Personal Actions
ro: Acțiuni personale

source: Why Choose ASET-FII Trading?
ro: De ce să alegi ASET-FII Aplicatie de Trading

source: Experience a fast, secure, and easy-to-use trading app directly in your web browser. With ASET-FII Trading, you can trade confidently and efficiently, accessing essential tools and market data on demand.
ro: Descoperă o aplicație de tranzacționare rapidă, sigură și ușor de utilizat direct în browserul tău web. Cu ASET-FII Trading, poți tranzacționa cu încredere și eficiență, având acces la instrumente esențiale și date de piață la cerere.

source: Real-Time Data
ro: Date in timp real

source: Get accurate and up-to-date market data at all times. Our platform provides live pricing and trading information, helping you make informed decisions on the fly.
ro: Obține date de piață precise și actualizate în orice moment. Platforma noastră oferă informații în timp real despre prețuri și tranzacții, ajutându-te să iei decizii informate rapid.

source: Advanced Analytics
ro: Analiză avansată

source: Analyze market trends with our robust analytics tools. Visualize historical data, track performance, and gain insights to refine your trading strategy.
ro: Analizează tendințele pieței cu ajutorul instrumentelor noastre de analiză performante. Vizualizează date istorice, urmărește performanța și obține informații pentru a-ți optimiza strategia de tranzacționare.

source: Secure & Reliable
ro: Sigur și de încredere

source: Trade with confidence knowing your data is secure. Our platform utilizes industry-leading encryption and security protocols to ensure that your transactions and personal information are always protected.
ro: Tranzacționează cu încredere, știind că datele tale sunt în siguranță. Platforma noastră utilizează criptare de top și protocoale de securitate avansate pentru a asigura protecția tranzacțiilor și a informațiilor tale personale în orice moment.

source: Available Securities
ro: Titluri disponibile

source: Explore a list of all the ASET Trading Securities you can buy on our platform.
ro: Explorează lista tuturor titlurilor de valoare disponibile pe platforma ASET Trading pe care le poți cumpăra.

source: Exchange:
ro: Bursă:

source: Ticker:
ro: Simbol bursier:

source: Price:
ro: Pret:

source: Buy Now
ro: Cumpara acum
